src/tests/performance/json-transformer-load-test.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 50
      name: "Load phase"
    - duration: 60
      arrivalRate: 100
      name: "Peak load phase"

scenarios:
  - name: "JSON Transformation Load Test"
    flow:
      - post:
          url: "/api/sanitize/json"
          json:
            data: '{"test": "data", "array": [1,2,3], "nested": {"key": "value"}}'
            transformOptions:
              filters:
                - pattern: "test"
                  type: "exclude"
              coercion:
                array: "string"
              preset: "aiProcessing"
          capture:
            - json: "$.transformed"
              as: "transformedData"
      - think: 1